class PoliceXol < ApplicationRecord
  belongs_to :contract
  has_one :police_xol_b
  has_one :gestion
  has_many :main_customer_as, inverse_of: :police_xol
  accepts_nested_attributes_for :main_customer_as, reject_if: lambda {|attributes| attributes['name'].blank?}
  has_many :historic_losses_as, inverse_of: :police_xol
  accepts_nested_attributes_for :historic_losses_as, reject_if: lambda {|attributes| attributes['amount_loss'].blank?}
  validate :require_one_historic, :require_one_main_customer


  CA = [
    [ 2000000, "1.000.000 à 2.500.000 €"],
    [ 4000000, "2.500.001 à 5.000.000 €"],
    [ 6500000, "5.000.001 à 7.500.000 €"],
    [ 9000000, "7.500.001 à 10.000.000 €"],
    [ 11500000, "10.000.001 à 12.500.000 €"],
    [ 14000000, "12.500.001 à 15.000.000 €"],
    [ 16500000, "15.000.001 à 17.500.000 €"],
    [ 19000000, "17.500.001 à 20.000.000 €"]
  ]

  CA_DOM = [
    [ 300000, "1€ à 500.000 €"],
    [ 800000, "500.001 à 1.000.000 €"],
    [ 1500000, "1.000.001 à 1.500.000 €"],
    [ 3000000, "1.500.001 à 2.500.000 €"],
    [ 4250000, "2.500.001 à 3.500.000 €"],
    [ 6500000, "3.000.001 à 5.000.000 €"],
    [ 8500000, "5.000.001 à 7.000.000 €"],
    [ 9000000, "7.000.001 à 10.000.000 €"],
    [ 12500000, "10 000 001 à 13 000 000 €"],
    [ 14500000, "13 000 001 à 15 000 000 €"]
  ]

  CA_EXPORT = [
    [ 800000, "1 à 1.000.000 €"],
    [ 1500000, "1.000.001 à 2.000.000 €"],
    [ 2500000, "2.000.001 à 3.000.000 €"],
    [ 3500000, "3.000.001 à 4.000.000 €"],
    [ 4500000, "4.000.001 à 5.000.000 €"],
    [ 6500000, "5.000.001 à 7.000.000 €"],
    [ 8500000, "7.000.001 à 9.000.000 €"],
    [ 10500000, "9.000.001 à 11.000.000 €"],
    [ 12500000, "11.000.001 à13.000.000 €"],
    [ 14500000, "13.000.001 à 15.000.000 €"]
  ]

  NUMBER = [
    [ 1, "up to 15"],
    [ 5, "16 to 30"],
    [ 10, "31 to 50"],
    [ 20, "51  to 75"],
    [ 40, "75 to 100"],
    [ 70, "100 to 150"],
    [ 125, "150 to 250"],
    [ 300, "> 251"]
  ]

  DELAI = [
    [ 1, "jusqu'à 30 jours"],
    [ 1, "jusqu'à 60 jours"],
    [ 1, "jusqu'à 90 jours"],
    [ 1, "jusqu'à 120 jours"],
    [ 1, "jusqu'à 180 jours"],
    [ 1, "> 180 jours"]
  ]

  DSO = [
    [80, "< 30 jours"],
    [75, "entre 30 et 45 jours"],
    [65, "entre 46 et 55 jours"],
    [50, "entre 56 et 60 jours"],
    [40, "entre 61 et 65 jours"],
    [30, "entre 66 et 70 jours"],
    [20, "entre 71 et 75 jours"],
    [10, "entre 76 et 80 jours"],
    [5, "entre 81 et 95 jours"],
    [0, "> 95 jours"]
  ]

  PERCENT_TURNOVER = [
    [ 1, '2,5%'],
    [ 1, '5 %'],
    [ 1, '7,5%'],
    [ 1, '10 %'],
    [ 1, '15 %'],
    [ 1, '20 %'],
    [ 1, '25 %'],
    [ 1, '30 %'],
    [ 1, '40 %'],
    [ 1, '> 40 %']
  ]

  CUMUL_LOSS = [
    [1, '< 15.000' ],
    [1, '15.001 to 25.000' ],
    [1, '25.001 to 50.000' ],
    [1, '50.001 to 75.000' ],
    [1, '75.001 to 100.000' ],
    [1, '100.001 to 150.000' ],
    [1, '150.001 to 200.000' ],
    [1, '200.001 to 250.000' ],
    [1, '250.001 to 300.000' ],
    [1, '300.001 to 400.000' ],
    [1, '400.001 to 500.000' ],
    [1, '500.001 to 750.000' ],
    [1, '750.001 to 1.000.000' ],
    [1, '> 1.000.001' ]
  ]


  MAX_LOSS = [
    [1, '< 15.000' ],
    [1, '15.001 to 25.000' ],
    [1, '25.001 to 50.000' ],
    [1, '50.001 to 75.000' ],
    [1, '75.001 to 100.000' ],
    [1, '100.001 to 150.000' ],
    [1, '150.001 to 200.000' ],
    [1, '200.001 to 250.000' ],
    [1, '250.001 to 300.000' ],
    [1, '300.001 to 400.000' ],
    [1, '400.001 to 500.000' ],
    [1, '500.001 to 750.000' ],
    [1, '750.001 to 1.000.000' ],
    [1, '> 1.000.001' ]
  ]

  NUMBER_CLIENT = [
  [ 1, '0 to 2' ],
  [ 1, '3 to 6' ],
  [ 1, '7 to 10' ],
  [ 1, '11 to 15' ],
  [ 1, '16 to 20' ],
  [ 1, '21 to 25' ],
  [ 1, '> 25' ]
  ]


private

    def require_one_historic
      errors.add(:base, "You must provide at least one historic") if historic_losses_as.size < 1
    end
    def require_one_main_customer
      errors.add(:base, "You must provide at least one customer") if main_customer_as.size < 1
    end
end
